{
  "cattak": {
    "en": [
      "Cotton picking last rounds; prepare wheat seed and land.",
      "Irrigate standing fodder as days get shorter; watch for pink bollworm residues in fields."
    ],
    "ur": [
      "روئی کی چنائی کے آخری چکر؛ گندم کے بیج اور زمین کی تیاری کریں۔",
      "چارے کو ہلکی آبپاشی دیں؛ کھیتوں میں گلابی سنڈی کے باقیات چیک کریں۔"
    ]
  },
  "maghar": {
    "en": [
      "Wheat: steady tillering after timely sowing (Nov 10–30).",
      "Potato: early digging from first sowing; manage late blight in evening fog.",
      "Mustard/Canola: flowering; keep field weed‑free.",
      "Gram (chana): sprouting; avoid standing water; watch frost."
    ],
    "ur": [
      "گندم: بر وقت بوائی کے بعد شگوفہ بننا جاری۔",
      "آلو: ابتدائی بوائی والی فصل کی کھدائی شروع؛ شام کی دھند میں لیٹ بلائٹ کا خیال رکھیں۔",
      "رائی/کینولا: پھول بننا؛ کھیت جڑی بوٹیوں سے پاک رکھیں۔",
      "چنا: اگاؤ؛ پانی نہ کھڑا ہونے دیں؛ کہرے/پالے سے بچاؤ۔"
    ]
  },
  "pooh": {
    "en": [
      "Wheat: first irrigation (wari) 18–21 days after sowing.",
      "Frost nights possible; avoid evening irrigation on gram and vegetables."
    ],
    "ur": [
      "گندم: پہلی آبپاشی (واری) بوائی کے 18–21 دن بعد۔",
      "سرد راتیں ممکن؛ چنے اور سبزیوں کو شام کے وقت پانی نہ دیں۔"
    ]
  },
  "maagh": {
    "en": [
      "Wheat: weed control window; urea top‑dressing after irrigation.",
      "Vegetables: monitor aphids/whitefly; use yellow sticky traps."
    ],
    "ur": [
      "گندم: جڑی بوٹیوں کے تدارک کا بہترین وقت؛ آبپاشی کے بعد یوریا ڈالیں۔",
      "سبزیاں: سفید مکھی/افڈ کا مشاہدہ؛ یلو سٹکی ٹریپس استعمال کریں۔"
    ]
  },
  "phagan": {
    "en": [
      "Wheat: booting/ear emergence; irrigation scheduling is critical.",
      "Gram: podding; avoid unnecessary irrigation before harvest."
    ],
    "ur": [
      "گندم: بالی نکلنا؛ آبپاشی کا شیڈول نہایت اہم۔",
      "چنا: پھلیاں بننا؛ کٹائی کے قریب غیرضروری پانی نہ دیں۔"
    ]
  },
  "cait": {
    "en": [
      "Harvest planning for wheat and gram; check combines and sacks.",
      "Sun‑dry seed; store with moisture below 12%."
    ],
    "ur": [
      "گندم اور چنے کی کٹائی کی تیاری؛ کمبائن اور بوریاں چیک کریں۔",
      "بیج دھوپ میں خشک کریں؛ نمی 12٪ سے کم رکھیں۔"
    ]
  }
}